Insurance/Insurance.API/Logs/log2023121216.txt

2023-12-12 16:48:39.137 +05:30 [INF] User profile is available. Using 'C:\Users\NanthagopalShanmugam\AppData\Local\ASP.NET\DataProtection-Keys' as key repository and Windows DPAPI to encrypt keys at rest.
2023-12-12 16:48:39.744 +05:30 [INF] Now listening on: https://localhost:7217
2023-12-12 16:48:39.746 +05:30 [INF] Now listening on: http://localhost:5217
2023-12-12 16:48:39.786 +05:30 [INF] Application started. Press Ctrl+C to shut down.
2023-12-12 16:48:39.788 +05:30 [INF] Hosting environment: Development
2023-12-12 16:48:39.789 +05:30 [INF] Content root path: C:\Hero_Insurance\HeroInsurance\Insurance\Insurance.API\
2023-12-12 16:48:40.132 +05:30 [INF] Request starting HTTP/2 GET https://localhost:7217/swagger/index.html - -
2023-12-12 16:48:40.693 +05:30 [INF] Request finished HTTP/2 GET https://localhost:7217/swagger/index.html - - - 200 - text/html;charset=utf-8 567.5090ms
2023-12-12 16:48:40.705 +05:30 [INF] Request starting HTTP/2 GET https://localhost:7217/_framework/aspnetcore-browser-refresh.js - -
2023-12-12 16:48:40.711 +05:30 [INF] Request starting HTTP/2 GET https://localhost:7217/_vs/browserLink - -
2023-12-12 16:48:40.711 +05:30 [INF] Request finished HTTP/2 GET https://localhost:7217/_framework/aspnetcore-browser-refresh.js - - - 200 13762 application/javascript;+charset=utf-8 5.9570ms
2023-12-12 16:48:40.769 +05:30 [INF] Request finished HTTP/2 GET https://localhost:7217/_vs/browserLink - - - 200 - text/javascript;+charset=UTF-8 58.2764ms
2023-12-12 16:48:40.828 +05:30 [INF] Request starting HTTP/2 GET https://localhost:7217/swagger/v1/swagger.json - -
2023-12-12 16:48:41.410 +05:30 [INF] Request finished HTTP/2 GET https://localhost:7217/swagger/v1/swagger.json - - - 200 - application/json;charset=utf-8 581.9451ms
2023-12-12 16:50:34.925 +05:30 [INF] Request starting HTTP/2 POST https://localhost:7217/api/v1/Quote/CreateProposal/DC874A12-6667-41AB-A7A1-3BB832B59CEB/D699AD68-16E1-4A5C-9628-0A55963F0309/2d566966-5525-4ed7-bd90-bb39e8418f39/false - 0
2023-12-12 16:50:35.024 +05:30 [INF] CORS policy execution successful.
2023-12-12 16:50:35.336 +05:30 [INF] Executing endpoint 'Insurance.API.Controllers.v1.QuoteController.CreateProposal (Insurance.API)'
2023-12-12 16:50:35.385 +05:30 [INF] Route matched with {action = "CreateProposal", controller = "Quote"}. Executing controller action with signature System.Threading.Tasks.Task`1[Microsoft.AspNetCore.Mvc.ActionResult`1[Insurance.Domain.GoDigit.QuoteResponseModel]] CreateProposal(System.String, System.String, System.String, Boolean, System.Threading.CancellationToken) on controller Insurance.API.Controllers.v1.QuoteController (Insurance.API).
2023-12-12 16:50:46.881 +05:30 [INF] UnitedIndia ConfirmQuote request Root <ROOT><HEADER><DAT_DATE_OF_EXPIRY_OF_POLICY>11/12/2026</DAT_DATE_OF_EXPIRY_OF_POLICY><DAT_DATE_OF_ISSUE_OF_POLICY>12/12/2023</DAT_DATE_OF_ISSUE_OF_POLICY><DAT_DATE_OF_REGISTRATION>01/12/2023</DAT_DATE_OF_REGISTRATION><DAT_HOURS_EFFECTIVE_FROM>00:00:01</DAT_HOURS_EFFECTIVE_FROM><NUM_IEV_ELEC_ACC_VALUE /><MEM_ADDRESS_OF_INSURED>2/47, Amman Nagar</MEM_ADDRESS_OF_INSURED><NUM_IEV_NON_ELEC_ACC_VALUE /><NUM_AGREEMENT_NAME_1>Hypothecation</NUM_AGREEMENT_NAME_1><NUM_BUSINESS_CODE>New Business</NUM_BUSINESS_CODE><NUM_CLIENT_TYPE>I</NUM_CLIENT_TYPE><NUM_CUBIC_CAPACITY>1061</NUM_CUBIC_CAPACITY><NUM_FINANCIER_NAME_1>2STATE BANK OF BIKANER &amp; JAIPUR</NUM_FINANCIER_NAME_1><NUM_IEV_BASE_VALUE>335681</NUM_IEV_BASE_VALUE><NUM_IEV_CNG_VALUE /><NUM_LL1 /><NUM_MONTH_OF_MANUFACTURE>12</NUM_MONTH_OF_MANUFACTURE><NUM_PA_UNNAMED_NUMBER /><NUM_PA_UNNAMED_AMOUNT /><NUM_PIN_CODE>641048</NUM_PIN_CODE><NUM_POLICY_TYPE>PackagePolicy</NUM_POLICY_TYPE><NUM_RGSTRD_SEATING_CAPACITY>5</NUM_RGSTRD_SEATING_CAPACITY><NUM_TPPD_AMOUNT>750000</NUM_TPPD_AMOUNT><NUM_VOLUNTARY_EXCESS_AMOUNT /><NUM_YEAR_OF_MANUFACTURE>2023</NUM_YEAR_OF_MANUFACTURE><TXT_CHASSIS_NUMBER>JBVFC237562745256</TXT_CHASSIS_NUMBER><TXT_DOB>06/07/1997</TXT_DOB><TXT_ELEC_DESC /><TXT_EMAIL_ADDRESS>nantha@gmail.com</TXT_EMAIL_ADDRESS><TXT_ENGINE_NUMBER>JNBV27346324</TXT_ENGINE_NUMBER><TXT_FINANCIER_BRANCH_ADDRESS1>Bye Chas, Road, Chas</TXT_FINANCIER_BRANCH_ADDRESS1><TXT_FIN_ACCOUNT_CODE_1>1937</TXT_FIN_ACCOUNT_CODE_1><TXT_FIN_BRANCH_NAME_1>MAHABIR CHOWK</TXT_FIN_BRANCH_NAME_1><TXT_FUEL>PETROL</TXT_FUEL><TXT_GENDER>Male</TXT_GENDER><TXT_GEOG_AREA_EXTN_COUNTRY /><TXT_MOBILE>9842338370</TXT_MOBILE><TXT_NAME_OF_INSURED>Nanthagopal S</TXT_NAME_OF_INSURED><TXT_NAME_OF_MANUFACTURER>MARUTI SUZUKI</TXT_NAME_OF_MANUFACTURER><TXT_NAME_OF_NOMINEE>Shan</TXT_NAME_OF_NOMINEE><TXT_NON_ELEC_DESC /><TXT_OEM_DEALER_CODE>DEA002</TXT_OEM_DEALER_CODE><TXT_OEM_TRANSACTION_ID>UIIC20231212165046</TXT_OEM_TRANSACTION_ID><TXT_OTHER_MAKE>WAGON R</TXT_OTHER_MAKE><TXT_PAN_NO>BRQPN1686R</TXT_PAN_NO><TXT_REGISTRATION_NUMBER_1>NEW</TXT_REGISTRATION_NUMBER_1><TXT_REGISTRATION_NUMBER_2 /><TXT_REGISTRATION_NUMBER_3 /><TXT_REGISTRATION_NUMBER_4 /><TXT_RELATION_WITH_NOMINEE>Father</TXT_RELATION_WITH_NOMINEE><TXT_TYPE_BODY>HATCHBACK</TXT_TYPE_BODY><TXT_VARIANT>LXI BS-III</TXT_VARIANT><YN_ANTI_THEFT>0</YN_ANTI_THEFT><TXT_CPA_COVER_PERIOD>3</TXT_CPA_COVER_PERIOD><YN_VALID_DRIVING_LICENSE>Y</YN_VALID_DRIVING_LICENSE><YN_COMPULSORY_PA_DTLS>-1</YN_COMPULSORY_PA_DTLS><YN_PAID_DRIVER>N</YN_PAID_DRIVER><YN_INBUILT_CNG>0</YN_INBUILT_CNG><YN_INBUILT_LPG>0</YN_INBUILT_LPG><YN_NIL_DEPR_WITHOUT_EXCESS>0</YN_NIL_DEPR_WITHOUT_EXCESS><YN_RTI_APPLICABLE>N</YN_RTI_APPLICABLE><YN_TYRE_RIM_PROTECTOR>N</YN_TYRE_RIM_PROTECTOR><NUM_TYRE_RIM_SUM_INSURED /><YN_ENGINE_GEAR_COVER>N</YN_ENGINE_GEAR_COVER><YN_LOSS_OF_KEY>N</YN_LOSS_OF_KEY><NUM_LOSS_OF_KEY_SUM_INSURED>3000</NUM_LOSS_OF_KEY_SUM_INSURED><YN_CONSUMABLE>N</YN_CONSUMABLE><NUM_VEHICLE_MODEL_CODE>10217</NUM_VEHICLE_MODEL_CODE><YN_RSA_COVER>N</YN_RSA_COVER><YN_NCB_PROTECT>False</YN_NCB_PROTECT></HEADER></ROOT>
2023-12-12 16:50:46.914 +05:30 [INF] UnitedIndia Proposa API Quotation request <?xml version="1.0" encoding="utf-16"?>
<soapenv:Envelope xmlns:ws="http://ws.uiic.com/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <ws:calculatePremium>
      <application>UIWBGENAGG</application>
      <userid>UIWBGENAGG</userid>
      <password>uiic1234</password>
      <proposalXml><![CDATA[<ROOT><HEADER><DAT_DATE_OF_EXPIRY_OF_POLICY>11/12/2026</DAT_DATE_OF_EXPIRY_OF_POLICY><DAT_DATE_OF_ISSUE_OF_POLICY>12/12/2023</DAT_DATE_OF_ISSUE_OF_POLICY><DAT_DATE_OF_REGISTRATION>01/12/2023</DAT_DATE_OF_REGISTRATION><DAT_HOURS_EFFECTIVE_FROM>00:00:01</DAT_HOURS_EFFECTIVE_FROM><NUM_IEV_ELEC_ACC_VALUE /><MEM_ADDRESS_OF_INSURED>2/47, Amman Nagar</MEM_ADDRESS_OF_INSURED><NUM_IEV_NON_ELEC_ACC_VALUE /><NUM_AGREEMENT_NAME_1>Hypothecation</NUM_AGREEMENT_NAME_1><NUM_BUSINESS_CODE>New Business</NUM_BUSINESS_CODE><NUM_CLIENT_TYPE>I</NUM_CLIENT_TYPE><NUM_CUBIC_CAPACITY>1061</NUM_CUBIC_CAPACITY><NUM_FINANCIER_NAME_1>2STATE BANK OF BIKANER &amp; JAIPUR</NUM_FINANCIER_NAME_1><NUM_IEV_BASE_VALUE>335681</NUM_IEV_BASE_VALUE><NUM_IEV_CNG_VALUE /><NUM_LL1 /><NUM_MONTH_OF_MANUFACTURE>12</NUM_MONTH_OF_MANUFACTURE><NUM_PA_UNNAMED_NUMBER /><NUM_PA_UNNAMED_AMOUNT /><NUM_PIN_CODE>641048</NUM_PIN_CODE><NUM_POLICY_TYPE>PackagePolicy</NUM_POLICY_TYPE><NUM_RGSTRD_SEATING_CAPACITY>5</NUM_RGSTRD_SEATING_CAPACITY><NUM_TPPD_AMOUNT>750000</NUM_TPPD_AMOUNT><NUM_VOLUNTARY_EXCESS_AMOUNT /><NUM_YEAR_OF_MANUFACTURE>2023</NUM_YEAR_OF_MANUFACTURE><TXT_CHASSIS_NUMBER>JBVFC237562745256</TXT_CHASSIS_NUMBER><TXT_DOB>06/07/1997</TXT_DOB><TXT_ELEC_DESC /><TXT_EMAIL_ADDRESS>nantha@gmail.com</TXT_EMAIL_ADDRESS><TXT_ENGINE_NUMBER>JNBV27346324</TXT_ENGINE_NUMBER><TXT_FINANCIER_BRANCH_ADDRESS1>Bye Chas, Road, Chas</TXT_FINANCIER_BRANCH_ADDRESS1><TXT_FIN_ACCOUNT_CODE_1>1937</TXT_FIN_ACCOUNT_CODE_1><TXT_FIN_BRANCH_NAME_1>MAHABIR CHOWK</TXT_FIN_BRANCH_NAME_1><TXT_FUEL>PETROL</TXT_FUEL><TXT_GENDER>Male</TXT_GENDER><TXT_GEOG_AREA_EXTN_COUNTRY /><TXT_MOBILE>9842338370</TXT_MOBILE><TXT_NAME_OF_INSURED>Nanthagopal S</TXT_NAME_OF_INSURED><TXT_NAME_OF_MANUFACTURER>MARUTI SUZUKI</TXT_NAME_OF_MANUFACTURER><TXT_NAME_OF_NOMINEE>Shan</TXT_NAME_OF_NOMINEE><TXT_NON_ELEC_DESC /><TXT_OEM_DEALER_CODE>DEA002</TXT_OEM_DEALER_CODE><TXT_OEM_TRANSACTION_ID>UIIC20231212165046</TXT_OEM_TRANSACTION_ID><TXT_OTHER_MAKE>WAGON R</TXT_OTHER_MAKE><TXT_PAN_NO>BRQPN1686R</TXT_PAN_NO><TXT_REGISTRATION_NUMBER_1>NEW</TXT_REGISTRATION_NUMBER_1><TXT_REGISTRATION_NUMBER_2 /><TXT_REGISTRATION_NUMBER_3 /><TXT_REGISTRATION_NUMBER_4 /><TXT_RELATION_WITH_NOMINEE>Father</TXT_RELATION_WITH_NOMINEE><TXT_TYPE_BODY>HATCHBACK</TXT_TYPE_BODY><TXT_VARIANT>LXI BS-III</TXT_VARIANT><YN_ANTI_THEFT>0</YN_ANTI_THEFT><TXT_CPA_COVER_PERIOD>3</TXT_CPA_COVER_PERIOD><YN_VALID_DRIVING_LICENSE>Y</YN_VALID_DRIVING_LICENSE><YN_COMPULSORY_PA_DTLS>-1</YN_COMPULSORY_PA_DTLS><YN_PAID_DRIVER>N</YN_PAID_DRIVER><YN_INBUILT_CNG>0</YN_INBUILT_CNG><YN_INBUILT_LPG>0</YN_INBUILT_LPG><YN_NIL_DEPR_WITHOUT_EXCESS>0</YN_NIL_DEPR_WITHOUT_EXCESS><YN_RTI_APPLICABLE>N</YN_RTI_APPLICABLE><YN_TYRE_RIM_PROTECTOR>N</YN_TYRE_RIM_PROTECTOR><NUM_TYRE_RIM_SUM_INSURED /><YN_ENGINE_GEAR_COVER>N</YN_ENGINE_GEAR_COVER><YN_LOSS_OF_KEY>N</YN_LOSS_OF_KEY><NUM_LOSS_OF_KEY_SUM_INSURED>3000</NUM_LOSS_OF_KEY_SUM_INSURED><YN_CONSUMABLE>N</YN_CONSUMABLE><NUM_VEHICLE_MODEL_CODE>10217</NUM_VEHICLE_MODEL_CODE><YN_RSA_COVER>N</YN_RSA_COVER><YN_NCB_PROTECT>False</YN_NCB_PROTECT></HEADER></ROOT>]]></proposalXml>
      <productCode>3111</productCode>
      <subproductCode>18</subproductCode>
    </ws:calculatePremium>
  </soapenv:Body>
</soapenv:Envelope>
2023-12-12 16:50:47.367 +05:30 [INF] Start processing HTTP request POST https://portal.uiic.in/UGenericServiceUAT/UGenericMotorOnlineService
2023-12-12 16:50:47.374 +05:30 [INF] Sending HTTP request POST https://portal.uiic.in/UGenericServiceUAT/UGenericMotorOnlineService
2023-12-12 16:51:35.500 +05:30 [INF] Received HTTP response headers after 48113.6992ms - 200
2023-12-12 16:51:35.509 +05:30 [INF] End processing HTTP request after 48152.3092ms - 200
2023-12-12 16:51:46.488 +05:30 [INF] UnitedIndia Proposal request Root <ROOT><HEADER><DAT_DATE_OF_EXPIRY_OF_POLICY>11/12/2026</DAT_DATE_OF_EXPIRY_OF_POLICY><DAT_DATE_OF_ISSUE_OF_POLICY>12/12/2023</DAT_DATE_OF_ISSUE_OF_POLICY><DAT_DATE_OF_REGISTRATION>01/12/2023</DAT_DATE_OF_REGISTRATION><DAT_HOURS_EFFECTIVE_FROM>00:00:01</DAT_HOURS_EFFECTIVE_FROM><NUM_IEV_ELEC_ACC_VALUE /><MEM_ADDRESS_OF_INSURED>2/47, Amman Nagar</MEM_ADDRESS_OF_INSURED><NUM_IEV_NON_ELEC_ACC_VALUE /><NUM_AGREEMENT_NAME_1>Hypothecation</NUM_AGREEMENT_NAME_1><NUM_BUSINESS_CODE>New Business</NUM_BUSINESS_CODE><NUM_CLIENT_TYPE>I</NUM_CLIENT_TYPE><NUM_CUBIC_CAPACITY>1061</NUM_CUBIC_CAPACITY><NUM_FINANCIER_NAME_1>2STATE BANK OF BIKANER &amp; JAIPUR</NUM_FINANCIER_NAME_1><NUM_IEV_BASE_VALUE>335681</NUM_IEV_BASE_VALUE><NUM_IEV_CNG_VALUE /><NUM_LL1 /><NUM_MONTH_OF_MANUFACTURE>12</NUM_MONTH_OF_MANUFACTURE><NUM_PA_UNNAMED_NUMBER /><NUM_PA_UNNAMED_AMOUNT /><NUM_PIN_CODE>641048</NUM_PIN_CODE><NUM_POLICY_TYPE>PackagePolicy</NUM_POLICY_TYPE><NUM_RGSTRD_SEATING_CAPACITY>5</NUM_RGSTRD_SEATING_CAPACITY><NUM_TPPD_AMOUNT>750000</NUM_TPPD_AMOUNT><NUM_VOLUNTARY_EXCESS_AMOUNT /><NUM_YEAR_OF_MANUFACTURE>2023</NUM_YEAR_OF_MANUFACTURE><TXT_CHASSIS_NUMBER>JBVFC237562745256</TXT_CHASSIS_NUMBER><TXT_DOB>06/07/1997</TXT_DOB><TXT_ELEC_DESC /><TXT_EMAIL_ADDRESS>nantha@gmail.com</TXT_EMAIL_ADDRESS><TXT_ENGINE_NUMBER>JNBV27346324</TXT_ENGINE_NUMBER><TXT_FINANCIER_BRANCH_ADDRESS1>Bye Chas, Road, Chas</TXT_FINANCIER_BRANCH_ADDRESS1><TXT_FIN_ACCOUNT_CODE_1>1937</TXT_FIN_ACCOUNT_CODE_1><TXT_FIN_BRANCH_NAME_1>MAHABIR CHOWK</TXT_FIN_BRANCH_NAME_1><TXT_FUEL>PETROL</TXT_FUEL><TXT_GENDER>Male</TXT_GENDER><TXT_GEOG_AREA_EXTN_COUNTRY /><TXT_MOBILE>9842338370</TXT_MOBILE><TXT_NAME_OF_INSURED>Nanthagopal S</TXT_NAME_OF_INSURED><TXT_NAME_OF_MANUFACTURER>MARUTI SUZUKI</TXT_NAME_OF_MANUFACTURER><TXT_NAME_OF_NOMINEE>Shan</TXT_NAME_OF_NOMINEE><TXT_NON_ELEC_DESC /><TXT_OEM_DEALER_CODE>DEA002</TXT_OEM_DEALER_CODE><TXT_OEM_TRANSACTION_ID>UIIC20231212165046</TXT_OEM_TRANSACTION_ID><TXT_OTHER_MAKE>WAGON R</TXT_OTHER_MAKE><TXT_PAN_NO>BRQPN1686R</TXT_PAN_NO><TXT_REGISTRATION_NUMBER_1>NEW</TXT_REGISTRATION_NUMBER_1><TXT_REGISTRATION_NUMBER_2 /><TXT_REGISTRATION_NUMBER_3 /><TXT_REGISTRATION_NUMBER_4 /><TXT_RELATION_WITH_NOMINEE>Father</TXT_RELATION_WITH_NOMINEE><TXT_TRANSACTION_ID>GR202312120001990887</TXT_TRANSACTION_ID><TXT_TYPE_BODY>HATCHBACK</TXT_TYPE_BODY><TXT_VARIANT>LXI BS-III</TXT_VARIANT><YN_ANTI_THEFT>0</YN_ANTI_THEFT><TXT_CPA_COVER_PERIOD>3</TXT_CPA_COVER_PERIOD><YN_VALID_DRIVING_LICENSE>Y</YN_VALID_DRIVING_LICENSE><YN_COMPULSORY_PA_DTLS>-1</YN_COMPULSORY_PA_DTLS><YN_PAID_DRIVER>N</YN_PAID_DRIVER><YN_INBUILT_CNG>0</YN_INBUILT_CNG><YN_INBUILT_LPG>0</YN_INBUILT_LPG><YN_NIL_DEPR_WITHOUT_EXCESS>0</YN_NIL_DEPR_WITHOUT_EXCESS><YN_RTI_APPLICABLE>N</YN_RTI_APPLICABLE><YN_TYRE_RIM_PROTECTOR>N</YN_TYRE_RIM_PROTECTOR><NUM_TYRE_RIM_SUM_INSURED /><YN_ENGINE_GEAR_COVER>N</YN_ENGINE_GEAR_COVER><YN_LOSS_OF_KEY>N</YN_LOSS_OF_KEY><NUM_LOSS_OF_KEY_SUM_INSURED>3000</NUM_LOSS_OF_KEY_SUM_INSURED><YN_CONSUMABLE>N</YN_CONSUMABLE><NUM_VEHICLE_MODEL_CODE>10217</NUM_VEHICLE_MODEL_CODE><YN_RSA_COVER>N</YN_RSA_COVER><YN_NCB_PROTECT>False</YN_NCB_PROTECT></HEADER></ROOT>
2023-12-12 16:51:46.490 +05:30 [INF] UnitedIndia create proposal <?xml version="1.0" encoding="utf-16"?>
<soapenv:Envelope xmlns:ws="http://ws.uiic.com/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <ws:saveProposal>
      <application>UIWBGENAGG</application>
      <userid>UIWBGENAGG</userid>
      <password>uiic1234</password>
      <proposalXml><![CDATA[<ROOT><HEADER><DAT_DATE_OF_EXPIRY_OF_POLICY>11/12/2026</DAT_DATE_OF_EXPIRY_OF_POLICY><DAT_DATE_OF_ISSUE_OF_POLICY>12/12/2023</DAT_DATE_OF_ISSUE_OF_POLICY><DAT_DATE_OF_REGISTRATION>01/12/2023</DAT_DATE_OF_REGISTRATION><DAT_HOURS_EFFECTIVE_FROM>00:00:01</DAT_HOURS_EFFECTIVE_FROM><NUM_IEV_ELEC_ACC_VALUE /><MEM_ADDRESS_OF_INSURED>2/47, Amman Nagar</MEM_ADDRESS_OF_INSURED><NUM_IEV_NON_ELEC_ACC_VALUE /><NUM_AGREEMENT_NAME_1>Hypothecation</NUM_AGREEMENT_NAME_1><NUM_BUSINESS_CODE>New Business</NUM_BUSINESS_CODE><NUM_CLIENT_TYPE>I</NUM_CLIENT_TYPE><NUM_CUBIC_CAPACITY>1061</NUM_CUBIC_CAPACITY><NUM_FINANCIER_NAME_1>2STATE BANK OF BIKANER &amp; JAIPUR</NUM_FINANCIER_NAME_1><NUM_IEV_BASE_VALUE>335681</NUM_IEV_BASE_VALUE><NUM_IEV_CNG_VALUE /><NUM_LL1 /><NUM_MONTH_OF_MANUFACTURE>12</NUM_MONTH_OF_MANUFACTURE><NUM_PA_UNNAMED_NUMBER /><NUM_PA_UNNAMED_AMOUNT /><NUM_PIN_CODE>641048</NUM_PIN_CODE><NUM_POLICY_TYPE>PackagePolicy</NUM_POLICY_TYPE><NUM_RGSTRD_SEATING_CAPACITY>5</NUM_RGSTRD_SEATING_CAPACITY><NUM_TPPD_AMOUNT>750000</NUM_TPPD_AMOUNT><NUM_VOLUNTARY_EXCESS_AMOUNT /><NUM_YEAR_OF_MANUFACTURE>2023</NUM_YEAR_OF_MANUFACTURE><TXT_CHASSIS_NUMBER>JBVFC237562745256</TXT_CHASSIS_NUMBER><TXT_DOB>06/07/1997</TXT_DOB><TXT_ELEC_DESC /><TXT_EMAIL_ADDRESS>nantha@gmail.com</TXT_EMAIL_ADDRESS><TXT_ENGINE_NUMBER>JNBV27346324</TXT_ENGINE_NUMBER><TXT_FINANCIER_BRANCH_ADDRESS1>Bye Chas, Road, Chas</TXT_FINANCIER_BRANCH_ADDRESS1><TXT_FIN_ACCOUNT_CODE_1>1937</TXT_FIN_ACCOUNT_CODE_1><TXT_FIN_BRANCH_NAME_1>MAHABIR CHOWK</TXT_FIN_BRANCH_NAME_1><TXT_FUEL>PETROL</TXT_FUEL><TXT_GENDER>Male</TXT_GENDER><TXT_GEOG_AREA_EXTN_COUNTRY /><TXT_MOBILE>9842338370</TXT_MOBILE><TXT_NAME_OF_INSURED>Nanthagopal S</TXT_NAME_OF_INSURED><TXT_NAME_OF_MANUFACTURER>MARUTI SUZUKI</TXT_NAME_OF_MANUFACTURER><TXT_NAME_OF_NOMINEE>Shan</TXT_NAME_OF_NOMINEE><TXT_NON_ELEC_DESC /><TXT_OEM_DEALER_CODE>DEA002</TXT_OEM_DEALER_CODE><TXT_OEM_TRANSACTION_ID>UIIC20231212165046</TXT_OEM_TRANSACTION_ID><TXT_OTHER_MAKE>WAGON R</TXT_OTHER_MAKE><TXT_PAN_NO>BRQPN1686R</TXT_PAN_NO><TXT_REGISTRATION_NUMBER_1>NEW</TXT_REGISTRATION_NUMBER_1><TXT_REGISTRATION_NUMBER_2 /><TXT_REGISTRATION_NUMBER_3 /><TXT_REGISTRATION_NUMBER_4 /><TXT_RELATION_WITH_NOMINEE>Father</TXT_RELATION_WITH_NOMINEE><TXT_TRANSACTION_ID>GR202312120001990887</TXT_TRANSACTION_ID><TXT_TYPE_BODY>HATCHBACK</TXT_TYPE_BODY><TXT_VARIANT>LXI BS-III</TXT_VARIANT><YN_ANTI_THEFT>0</YN_ANTI_THEFT><TXT_CPA_COVER_PERIOD>3</TXT_CPA_COVER_PERIOD><YN_VALID_DRIVING_LICENSE>Y</YN_VALID_DRIVING_LICENSE><YN_COMPULSORY_PA_DTLS>-1</YN_COMPULSORY_PA_DTLS><YN_PAID_DRIVER>N</YN_PAID_DRIVER><YN_INBUILT_CNG>0</YN_INBUILT_CNG><YN_INBUILT_LPG>0</YN_INBUILT_LPG><YN_NIL_DEPR_WITHOUT_EXCESS>0</YN_NIL_DEPR_WITHOUT_EXCESS><YN_RTI_APPLICABLE>N</YN_RTI_APPLICABLE><YN_TYRE_RIM_PROTECTOR>N</YN_TYRE_RIM_PROTECTOR><NUM_TYRE_RIM_SUM_INSURED /><YN_ENGINE_GEAR_COVER>N</YN_ENGINE_GEAR_COVER><YN_LOSS_OF_KEY>N</YN_LOSS_OF_KEY><NUM_LOSS_OF_KEY_SUM_INSURED>3000</NUM_LOSS_OF_KEY_SUM_INSURED><YN_CONSUMABLE>N</YN_CONSUMABLE><NUM_VEHICLE_MODEL_CODE>10217</NUM_VEHICLE_MODEL_CODE><YN_RSA_COVER>N</YN_RSA_COVER><YN_NCB_PROTECT>False</YN_NCB_PROTECT></HEADER></ROOT>]]></proposalXml>
      <productCode>3111</productCode>
      <subproductCode>18</subproductCode>
    </ws:saveProposal>
  </soapenv:Body>
</soapenv:Envelope>
2023-12-12 16:51:46.584 +05:30 [INF] Start processing HTTP request POST https://portal.uiic.in/UGenericServiceUAT/UGenericMotorOnlineService
2023-12-12 16:51:46.586 +05:30 [INF] Sending HTTP request POST https://portal.uiic.in/UGenericServiceUAT/UGenericMotorOnlineService
2023-12-12 16:53:10.416 +05:30 [INF] Received HTTP response headers after 83827.2839ms - 200
2023-12-12 16:53:10.419 +05:30 [INF] End processing HTTP request after 83835.735ms - 200
